Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Every task has also an enabled flag which defaults to true.
zh_cn: 每一项任务有一个默认值为true的enabled标记。

source: Example: someTask.dependsOn(":someOtherProject:someOtherTask")
zh_cn: 示例：someTask.dependsOn(":someOtherProject:someOtherTask")

source: Examples include using 'groovy' in place of 'groovy-all', or using 'log4j-over-slf4j' instead of 'log4j'.
zh_cn: 示例包括，使用“groovy”来代替“groovy-all”，或者使用“log4j-over-slf4j”来代替“log4j”。

source: Examples of different variants include debug vs release binaries, 32-bit vs 64-bit binaries, and binaries produced with different custom preprocessor flags.
zh_cn: 这样的例子包括debug及release的二进制文件，32位及64位的二进制文件，以及使用不同的自定义预处理标志生成的二进制文件。

source: Examples:
zh_cn: 示例：

source: Example 10.1. War plugin
zh_cn: 示例 10.1. 使用War 插件

source: Example 13.1. Accessing property of the Project object
zh_cn: Example 13.1. 访问 Project 对象的属性

source: Example 13.2. Using local variables
zh_cn: 示例 13.2. 使用局部变量

source: Example 13.3. Using extra properties
zh_cn: 13.3 例子. 使用额外属性

source: Example 13.4. Groovy JDK methods
zh_cn: 示例 13.4. Groovy JDK 的方法

source: Example 13.5. Property accessors
zh_cn: 例子 13.5. 属性访问器

source: Example 13.6. Method call without parentheses
zh_cn: 示例 13.6. 不带括号的方法调用

source: Example 13.7. List and map literals
zh_cn: Example 13.7. List and map

source: Example 13.8. Closure as method parameter
zh_cn: Example 13.8. 作为方法参数的闭包

source: Example 13.9. Closure delegates
zh_cn: Example 13.9. 闭包委托

source: Example 14.1. Directory creation with mkdir
zh_cn: 示例 14.1. 使用 mkdir 创建目录

source: Example 14.2. Setting properties with a gradle.properties file
zh_cn: 未例 14.2. 使用 gradle.properties 文件设置属性

source: Example 14.3. Configuring the project using an external build script
zh_cn: 示例14.3. 使用外部构建脚本配置项目

source: Example 14.4. Configuring arbitrary objects
zh_cn: 示例 14.4. 配置任意对象

source: Example 14.5. Configuring arbitrary objects using a script
zh_cn: 示例14.5. 使用脚本配置任意对象

source: Example 15.1. Defining tasks
zh_cn: 示例 15.1. 定义任务

source: Example 15.10. Defining a task with closure
zh_cn: 示例 15.10. 使用闭包定义任务

source: Example 15.11. Adding dependency on task from another project
zh_cn: 示例 15.11. 从另一个项目的任务上添加依赖

source: Example 15.12. Adding dependency using task object
zh_cn: 示例 15.12. 使用 task 对象添加依赖

source: Example 15.13. Adding dependency using closure
zh_cn: 示例 15.13. 使用闭包添加依赖

source: Example 15.14. Adding a 'must run after' task ordering
zh_cn: 示例 15.14. 添加 '必须在之后运行 ' 的任务排序

source: Example 15.15. Adding a 'should run after' task ordering
zh_cn: 示例 15.15. 添加 '应该在之后运行 ' 的任务排序

source: Example 15.16. Task ordering does not imply task execution
zh_cn: 示例 15.16. 任务排序并不意味着任务执行

source: Example 15.17. A 'should run after' task ordering is ignored if it introduces an ordering cycle
zh_cn: 示例 15.17. 当引入循环时，“应该在其之后运行”的任务排序会被忽略

source: Example 15.18. Adding a description to a task
zh_cn: 示例 15.18. 向任务添加描述

source: Example 15.19. Overwriting a task
zh_cn: 示例 15.19. 重写任务

source: Example 15.2. Defining tasks - using strings for task names
zh_cn: 示例 15.2. 定义任务 — — 使用字符串作为任务名称

source: Example 15.20. Skipping a task using a predicate
zh_cn: 示例 15.20. 使用断言跳过一个任务

source: Example 15.21. Skipping tasks with StopExecutionException
zh_cn: 示例 15.21. 使用 StopExecutionException 跳过任务

source: Example 15.22. Enabling and disabling tasks
zh_cn: 示例 15.22. 启用和禁用任务

source: Example 15.23. A generator task
zh_cn: 示例 15.23. 一个生成任务

source: Example 15.24. Declaring the inputs and outputs of a task
zh_cn: 示例 15.24. 声明一个任务的输入和输出

source: Example 15.25. Task rule
zh_cn: 示例 15.25. 任务规则

source: Example 15.26. Dependency on rule based tasks
zh_cn: 示例 15.26. 基于规则的任务依赖

source: Example 15.27. Adding a task finalizer
zh_cn: 示例 15.27. 添加一个析构器任务

source: Example 15.28. Task finalizer for a failing task
zh_cn: 示例 15.28. 执行失败的任务的任务析构器

source: Example 15.3. Defining tasks with alternative syntax
zh_cn: 示例 15.3. 使用替代语法定义任务

source: Example 15.4. Accessing tasks as properties
zh_cn: 示例 15.4. 以属性方式访问任务

source: Example 15.5. Accessing tasks via tasks collection
zh_cn: 示例 15.5. 通过tasks集合访问任务

source: Example 15.6. Accessing tasks by path
zh_cn: 示例 15.6. 通过路径访问任务

source: Example 15.7. Creating a copy task
zh_cn: 示例 15.7. 创建一个复制任务

source: Example 15.8. Configuring a task - various ways
zh_cn: 示例 15.8. 配置任务的几种方式

source: Example 15.9. Configuring a task - with closure
zh_cn: 示例 15.9. 配置任务-使用闭包

source: Example 16.1. Locating files
zh_cn: 示例 16.1. 查找文件

source: Example 16.10. Copying files using the copy task
zh_cn: 示例 16.10. 使用copy任务复制文件

source: Example 16.11. Specifying copy task source files and destination directory
zh_cn: 示例 16.11. 指定复制任务的源文件和目标目录

source: Example 16.12. Selecting the files to copy
zh_cn: 示例 16.12. 选择要复制的文件

source: Example 16.13. Copying files using the copy() method without up-to-date check
zh_cn: 示例 16.13. 使用没有最新状态检查的 copy() 方法复制文件

source: Example 16.14. Copying files using the copy() method with up-to-date check
zh_cn: 示例 16.14. 使用有最新状态检查的 copy() 方法复制文件

source: Example 16.15. Renaming files as they are copied
zh_cn: 示例 16.15. 重命名复制的文件

source: Example 16.16. Filtering files as they are copied
zh_cn: 示例 16.16. 过滤要复制的文件

source: Example 16.17. Nested copy specs
zh_cn: 示例 16.17. 嵌套的复制规范

source: Example 16.18. Using the Sync task to copy dependencies
zh_cn: 示例 16.18. 使用同步任务复制依赖项

source: Example 16.19. Creating a ZIP archive
zh_cn: 示例 16.19. 创建一个 ZIP 文件

source: Example 16.2. Creating a file collection
zh_cn: 示例 16.2. 创建一个文件集合

source: Example 16.20. Creation of ZIP archive
zh_cn: 示例 16.20. 创建 ZIP 文件

source: Example 16.21. Configuration of archive task - custom archive name
zh_cn: 示例 16.21. 配置归档任务-自定义归档名称

source: Example 16.22. Configuration of archive task - appendix & classifier
zh_cn: 示例 16.22. 配置归档任务 - appendix & classifier

source: Example 16.3. Using a file collection
zh_cn: 示例 16.3. 使用一个文件集合

source: Example 16.4. Implementing a file collection
zh_cn: 示例 16.4. 实现一个文件集合

source: Example 16.5. Creating a file tree
zh_cn: 示例 16.5. 创建一个文件树

source: Example 16.6. Using a file tree
zh_cn: 示例 16.6. 使用文件树

source: Example 16.7. Using an archive as a file tree
zh_cn: 示例 16.7. 使用归档文件作为文件树

source: Example 16.8. Specifying a set of files
zh_cn: 示例 16.8. 指定一组文件

source: Example 16.9. Specifying a set of files
zh_cn: 示例 16.9. 指定一组文件

source: Example 17.1. Using an Ant task
zh_cn: 示例 17.1. 使用 Ant 任务

source: Example 17.10. Adding behaviour to an Ant target
zh_cn: 示例 17.10. 将行为添加到 Ant 目标

source: Example 17.11. Ant target that depends on Gradle task
zh_cn: 示例 17.11. 依赖于 Gradle 任务的 Ant 目标

source: Example 17.12. Setting an Ant property
zh_cn: 示例 17.12. Ant 属性设置

source: Example 17.13. Getting an Ant property
zh_cn: 示例 17.13. 获取 Ant 属性

source: Example 17.14. Setting an Ant reference
zh_cn: 示例 17.14. Ant 引用设置

source: Example 17.15. Getting an Ant reference
zh_cn: 示例 17.15. 获取 Ant 引用

source: Example 17.2. Passing nested text to an Ant task
zh_cn: 示例 17.2. 向 Ant 任务传入嵌套文本

source: Example 17.3. Passing nested elements to an Ant task
zh_cn: 示例 17.3. 向 Ant 任务传入嵌套元素

source: Example 17.4. Using an Ant type
zh_cn: 示例 17.4. 使用 Ant 类型

source: Example 17.5. Using a custom Ant task
zh_cn: 示例 17.5. 使用自定义 Ant 任务

source: Example 17.6. Declaring the classpath for a custom Ant task
zh_cn: 示例 17.6. 声明用于自定义 Ant 任务的类路径

source: Example 17.7. Using a custom Ant task and dependency management together
zh_cn: 示例 17.7. 同时使用自定义 Ant 任务和依赖管理

source: Example 17.8. Importing an Ant build
zh_cn: 示例 17.8. 导入 Ant 构建

source: Example 17.9. Task that depends on Ant target
zh_cn: 示例 17.9. 依赖于 Ant 目标的任务

source: Example 18.1. Using stdout to write log messages
zh_cn: 示例18.1. 使用标准输出写日志

source: Example 18.2. Writing your own log messages
zh_cn: 示例 18.2. 编写自己的日志消息

source: Example 18.3. Using SLF4J to write log messages
zh_cn: 示例 18.3. 使用 SLF4J 编写日志消息

source: Example 18.4. Configuring standard output capture
zh_cn: 示例 18.4. 配置标准输出捕获

source: Example 18.5. Configuring standard output capture for a task
zh_cn: 示例 18.5. 对任务配置标准输出捕获

source: Example 18.6. Customizing what Gradle logs
zh_cn: 示例 18.6 的例子. 自定义 Gradle 日志

source: Example 20.1. Configuring an HTTP proxy
zh_cn: 示例 20.1. 配置 HTTP 代理服务器

source: Example 20.2. Configuring an HTTPS proxy
zh_cn: 示例 20.2. 配置 HTTPS 代理服务器

source: Example 21.1. Applying a plugin
zh_cn: 示例 21.1. 应用插件

source: Example 21.2. Applying a plugin by type
zh_cn: 示例 21.2. 通过类型应用插件

source: Example 21.3. Applying a plugin by type
zh_cn: 示例 21.3. 通过类型应用插件

source: Example 21.4. Tasks added by a plugin
zh_cn: 示例 21.4. 通过插件添加任务

source: Example 21.5. Changing plugin defaults
zh_cn: 示例 21.5. 更改插件的默认设置

source: Example 21.6. Plugin convention object
zh_cn: 示例 21.6. 插件中的约定对象

source: Example 23.1. Using the Java plugin
zh_cn: 示例 23.1. 使用 Java 插件

source: Example 23.10. Running tests in a source set
zh_cn: 示例 23.10. 运行源集里的测试

source: Example 23.11. Filtering tests in the build script
zh_cn: 示例 23.11. 在构建脚本中过滤测试

source: Example 23.12. JUnit Categories
zh_cn: 示例 23.12. JUnit 类别

source: Example 23.13. Grouping TestNG tests
zh_cn: 示例 23.13. 对TestNG 测试分组

source: Example 23.14. Creating a unit test report for subprojects
zh_cn: 示例 23.14. 为多个子项目创建一个单元测试报告

source: Example 23.15. Customization of MANIFEST.MF
zh_cn: 示例 23.15. 自定义的MANIFEST.MF

source: Example 23.16. Creating a manifest object.
zh_cn: 示例 23.16. 创建一个manifest 对象。

source: Example 23.17. Separate MANIFEST.MF for a particular archive
zh_cn: 示例 23.17. 指定archive的单独MANIFEST.MF

source: Example 23.18. Separate MANIFEST.MF for a particular archive
zh_cn: 示例 23.18. 指定archive的单独 MANIFEST.MF

source: Example 23.2. Custom Java source layout
zh_cn: 示例 23.2. 自定义Java 源代码布局

source: Example 23.3. Accessing a source set
zh_cn: 示例 23.3. 访问源集

source: Example 23.4. Configuring the source directories of a source set
zh_cn: 示例 23.4. 配置源集的源代码目录

source: Example 23.5. Defining a source set
zh_cn: 示例 23.5. 定义一个源集

source: Example 23.6. Defining source set dependencies
zh_cn: 示例 23.6. 定义源集依赖

source: Example 23.7. Compiling a source set
zh_cn: 示例 23.7. 编译源集

source: Example 23.8. Assembling a JAR for a source set
zh_cn: 示例 23.8. 为一个源集装配一个JAR文件

source: Example 23.9. Generating the Javadoc for a source set
zh_cn: 示例 23.9. 为一个源集生成 Javadoc：

source: Example 24.1. Using the Groovy plugin
zh_cn: 示例 24.1. 使用 Groovy 插件

source: Example 24.2. Custom Groovy source layout
zh_cn: 示例 24.2. 自定义 Groovy 自定义源文件布局

source: Example 24.3. Configuration of Groovy dependency
zh_cn: 示例 24.3. Groovy 的依赖配置

source: Example 24.4. Configuration of Groovy test dependency
zh_cn: 示例 24.4. 配置Groovy 测试依赖

source: Example 24.5. Configuration of bundled Groovy dependency
zh_cn: 示例 24.5. 配置捆绑的 Groovy 依赖

source: Example 24.6. Configuration of Groovy file dependency
zh_cn: 示例 24.6. 配置Groovy 文件依赖

source: Example 25.1. Using the Scala plugin
zh_cn: 示例 25.1. 使用 Scala 插件

source: Example 25.2. Custom Scala source layout
zh_cn: 示例 24.2. 自定义 Scala 源文件布局

source: Example 25.3. Declaring a Scala dependency for production code
zh_cn: 示例 25.3. 为production 代码定义一个Scala 依赖

source: Example 25.4. Declaring a Scala dependency for test code
zh_cn: 示例 25.4. 为 test 代码定义一个Scala 依赖

source: Example 25.5. Enabling the Fast Scala Compiler
zh_cn: 示例 25.5. 启用 Fast Scala Compiler

source: Example 25.6. Adjusting memory settings
zh_cn: 示例 25.6. 调整内存设置

source: Example 25.7. Activating the Zinc based compiler
zh_cn: 示例 25.7. 激活基于 Zinc 编译器

source: Example 26.1. Using the War plugin
zh_cn: 示例 26.1. 使用War 插件

source: Example 26.2. Customization of war plugin
zh_cn: 示例 26.2. war 插件的自定义

source: Example 27.1. Using the Ear plugin
zh_cn: 示例 27.1. 使用 Ear 插件

source: Example 27.2. Customization of ear plugin
zh_cn: 示例 26.2. ear 插件的自定义

source: Example 28.1. Using the Jetty plugin
zh_cn: 示例 28.1. 使用 Jetty 插件

source: Example 29.1. Using the Checkstyle plugin
zh_cn: 示例 29.1. 使用 Checkstyle 插件

source: Example 30.1. Using the CodeNarc plugin
zh_cn: 示例 30.1. 使用 CodeNarc 插件

source: Example 31.1. Using the FindBugs plugin
zh_cn: 示例 31.1. 使用 FindBugs 插件

source: Example 32.1. Using the JDepend plugin
zh_cn: 示例 32.1. 使用 JDepend 插件

source: Example 33.1. Using the PMD plugin
zh_cn: 示例 33.1. 使用 PMD 插件

source: Example 34.1. Applying the JaCoCo plugin
zh_cn: 示例 34.1. 应用 JaCoCo 插件

source: Example 34.2. Configuring JaCoCo plugin settings
zh_cn: 示例 34.2. 配置 JaCoCo 插件设置

source: Example 34.3. Configuring test task
zh_cn: 示例 34.3. 配置测试任务

source: Example 34.4. Configuring test task
zh_cn: 示例 34.4. 配置测试任务

source: Example 34.5. Using application plugin to generate code coverage data
zh_cn: 示例 34.5. 使用 application 插件来生成代码覆盖率数据

source: Example 34.6. Coverage reports generated by applicationCodeCoverageReport
zh_cn: 示例 34.6. 由 applicationCodeCoverageReport 生成的覆盖率报告

source: Example 35.1. Applying the Sonar plugin
zh_cn: 示例 35.1. 配置使用 Sonar 插件

source: Example 35.10. Analyzing languages other than Java
zh_cn: 示例 35.10. 分析非 Java 语言

source: Example 35.11. Setting custom global properties
zh_cn: 示例 35.11. 设置自定义的全局属性

source: Example 35.12. Setting custom project properties
zh_cn: 示例 35.12. 设置自定义的项目属性

source: Example 35.13. Implementing custom command line properties
zh_cn: 示例 35.13. 实现自定义命令行属性

source: Example 35.2. Configuring Sonar connection settings
zh_cn: 示例 35.2. 配置 Sonar 连接设置

source: Example 35.3. Configuring Sonar project settings
zh_cn: 示例 35.3. 配置 Sonar project 设置

source: Example 35.4. Global configuration in a multi-project build
zh_cn: 示例 35.4. 在多项目构建中的全局配置

source: Example 35.5. Common project configuration in a multi-project build
zh_cn: 示例 35.5. 多项目构建中的共同项目配置

source: Example 35.6. Individual project configuration in a multi-project build
zh_cn: 示例 35.6. 多项目构建中的单独项目配置

source: Example 35.7. Configuring the language to be analyzed
zh_cn: 示例 35.7. 配置语言分析

source: Example 35.8. Using property syntax
zh_cn: 示例 35.8. 使用属性语法

source: Example 35.9. Analyzing custom source sets
zh_cn: 示例 35.9. 分析自定义的Source Sets

source: Example 36.1. Applying the Sonar Runner plugin
zh_cn: 示例 36.1. 配置使用 Sonar Runner 插件

source: Example 36.2. Configuring Sonar connection settings
zh_cn: 示例 36.2. 配置 Sonar 连接设置

source: Example 36.3. Global configuration settings
zh_cn: 示例 36.3. 全局配置设置

source: Example 36.4. Shared configuration settings
zh_cn: 示例 36.4. 共享的配置设置

source: Example 36.5. Individual configuration settings
zh_cn: 示例 36.5. 个别配置设置

source: Example 36.6. Skipping analysis of a project
zh_cn: 示例 36.6. 跳过项目分析

source: Example 36.7. Analyzing custom source sets
zh_cn: 示例 36.7. 分析自定义的Source Sets

source: Example 36.8. Analyzing languages other than Java
zh_cn: 示例 36.8. 分析非 Java 语言

source: Example 37.1. Using the OSGi plugin
zh_cn: 示例 37.1. 使用 OSGi 插件

source: Example 37.2. Configuration of OSGi MANIFEST.MF file
zh_cn: 示例 37.2. OSGi MANIFEST.MF 文件配置

source: Example 38.1. Using the Eclipse plugin
zh_cn: 示例 38.1. 使用 Eclipse 插件

source: Example 38.2. Partial Overwrite for Classpath
zh_cn: 示例 38.2. 部分覆盖 Classpath

source: Example 38.3. Partial Overwrite for Project
zh_cn: 示例 38.3. 部分覆盖项目

source: Example 38.4. Export Dependencies
zh_cn: 示例 38.4. 导出依赖项

source: Example 38.5. Customizing the XML
zh_cn: 示例 38.5. 自定义 XML

source: Example 39.1. Using the IDEA plugin
zh_cn: 示例 39.1. 使用 IDEA 插件

source: Example 39.2. Partial Overwrite for Module
zh_cn: 示例 39.2. 部分覆盖模块

source: Example 39.3. Partial Overwrite for Project
zh_cn: 示例 39.3. 部分覆盖项目

source: Example 39.4. Export Dependencies
zh_cn: 示例 39.4. 导出依赖项

source: Example 39.5. Customizing the XML
zh_cn: 示例 39.5. 自定义 XML

source: Example 40.1. Using the ANTLR plugin
zh_cn: 示例 40.1. 使用 ANTLR 插件

source: Example 40.2. Declare ANTLR version
zh_cn: 示例 40.2. 声明 ANTLR 版本

source: Example 42.1. Using the announce plugin
zh_cn: 示例 42.1. 使用 announce 插件

source: Example 42.2. Configure the announce plugin
zh_cn: 示例 42.2. 配置 announce 插件

source: Example 42.3. Using the announce plugin
zh_cn: 示例 42.3. 使用 announce 插件

source: Example 43.1. Using the build announcements plugin
zh_cn: 示例 43.1. 使用构建公告插件

source: Example 43.2. Using the build announcements plugin from an init script
zh_cn: 示例 43.2. 在 init 脚本中使用构建通知插件

source: Example 44.1. Using the distribution plugin
zh_cn: 示例 44.1. 使用分发插件

source: Example 44.2. Adding extra distributions
zh_cn: 示例 44.2. 添加额外的分发

source: Example 44.3. Configuring the main distribution
zh_cn: 示例 44.3. 配置 main distribution

source: Example 45.1. Using the application plugin
zh_cn: 示例 45.1. 使用应用程序插件

source: Example 45.2. Configure the application main class
zh_cn: 示例 45.2. 配置应用程序的主类

source: Example 45.3. Configure default JVM settings
zh_cn: 示例 45.3. 配置默认 JVM 设置

source: Example 45.4. Include output from other tasks in the application distribution
zh_cn: 示例 45.4. 在应用程序的分发中包含其他任务的输出文件

source: Example 45.5. Automatically creating files for distribution
zh_cn: 示例 45.5. 自动创建用于分发的文件

source: Example 46.1. Using the java library distribution plugin
zh_cn: 示例 46.1. 使用 Java 库分发插件

source: Example 46.2. Configure the distribution name
zh_cn: 示例 46.2. 配置分发的名称

source: Example 46.3. Include files in the distribution
zh_cn: 示例 46.3. 在分发包中包含文件

source: Example 49.1. Using the Build Dashboard plugin
zh_cn: 示例 49.1 使用 Build Dashboard 插件

source: Example 50.1. Definition of a configuration
zh_cn: 示例 50.1. 配置的定义

source: Example 50.10. File dependencies
zh_cn: 示例 50.10. 文件依赖

source: Example 50.11. Generated file dependencies
zh_cn: 示例 50.11. 生成文件依赖

source: Example 50.12. Gradle API dependencies
zh_cn: 示例 50.12. Gradle API 依赖

source: Example 50.13. Gradle's Groovy dependencies
zh_cn: 示例 50.13. Gradle 的 Groovy 依赖

source: Example 50.14. Excluding transitive dependencies
zh_cn: 示例 50.14. 排除传递依赖

source: Example 50.15. Optional attributes of dependencies
zh_cn: 示例 50.15. 依赖的可选属性

source: Example 50.16. Collections and arrays of dependencies
zh_cn: 示例 50.16. 依赖的集合和数组

source: Example 50.17. Dependency configurations
zh_cn: 示例 50.17. 依赖配置

source: Example 50.18. Dependency configurations for project
zh_cn: 示例 50.18. 项目的依赖配置

source: Example 50.19. Configuration.copy
zh_cn: 示例 50.19. Configuration.copy

source: Example 50.2. Accessing a configuration
zh_cn: 示例 50.2. 访问配置

source: Example 50.20. Accessing declared dependencies
zh_cn: 示例 50.20. 访问声明依赖

source: Example 50.21. Configuration.files
zh_cn: 示例 50.21. Configuration.files

source: Example 50.22. Configuration.files with spec
zh_cn: 示例 50.22. 指定的 Configuration.files

source: Example 50.23. Configuration.copy
zh_cn: 示例 50.23. Configuration.copy

source: Example 50.24. Configuration.copy vs. Configuration.files
zh_cn: 示例 50.24. Configuration.copy 与 Configuration.files

source: Example 50.25. Adding central Maven repository
zh_cn: 示例 50.25. 添加 Maven 中央仓库

source: Example 50.26. Adding Bintray's JCenter Maven repository
zh_cn: 示例 50.26. 添加 Bintray Jcenter Maven 仓库

source: Example 50.27. Adding the local Maven cache as a repository
zh_cn: 示例 50.27. 添加本地 Maven 缓存作为仓库：

source: Example 50.28. Adding custom Maven repository
zh_cn: 示例 50.28. 添加一个自定义的 Maven 仓库

source: Example 50.29. Adding additional Maven repositories for JAR files
zh_cn: 示例 50.29. 为 JAR 文件添加额外的 Maven 仓库

source: Example 50.3. Configuration of a configuration
zh_cn: 示例 50.3. 配置一个配置

source: Example 50.30. Accessing password protected Maven repository
zh_cn: 示例 50.30. 访问密码保护的 Maven 仓库

source: Example 50.31. Flat repository resolver
zh_cn: 示例 50.31. 平面仓库的解决

source: Example 50.32. Ivy repository
zh_cn: 示例 50.32. Ivy存储库

source: Example 50.33. Ivy repository with pattern layout
zh_cn: 示例 50.33. Ivy 仓库模式布局

source: Example 50.34. Ivy repository with Maven compatible layout
zh_cn: 示例50.34. 使用 Maven 兼容布局的 Ivy 仓库

source: Example 50.35. Ivy repository with custom patterns
zh_cn: 示例 50.35. 自定义模式的 Ivy 仓库

source: Example 50.36. Ivy repository
zh_cn: 示例 50.36. Ivy存储库

source: Example 50.37. Accessing a repository
zh_cn: 示例 50.37. 访问一个仓库：

source: Example 50.38. Configuration of a repository
zh_cn: 示例 50.38. 仓库配置

source: Example 50.39. Definition of a custom repository
zh_cn: 示例 50.39. 自定义仓库的定义

source: Example 50.4. Module dependencies
zh_cn: 示例 50.4. 模块依赖

source: Example 50.40. Forcing consistent version for a group of libraries
zh_cn: 示例 50.40. 强制一个组的所有库使用一致的版本

source: Example 50.41. Using a custom versioning scheme
zh_cn: 示例 50.41. 使用自定义的版本方案

source: Example 50.42. Blacklisting a version with a replacement
zh_cn: 示例 50.42. 黑名单替换特定版本

source: Example 50.43. Changing dependency group and/or name at the resolution
zh_cn: 示例 50.43. 在解析中更改依赖组及名称

source: Example 50.44. Enabling dynamic resolve mode
zh_cn: 示例 50.44. 启用动态解析模式

source: Example 50.45. 'Latest' version selector
zh_cn: 示例 50.45，“Latest”版本选择器

source: Example 50.46. Custom status scheme
zh_cn: 示例 50.46. 自定义状态模式

source: Example 50.47. Dynamic version cache control
zh_cn: 示例 50.47. 动态版本缓存控制

source: Example 50.48. Changing module cache control
zh_cn: 示例 50.48. 变化模块的缓存控制

source: Example 50.5. Artifact only notation
zh_cn: 示例 505. Artifact only notation

source: Example 50.6. Dependency with classifier
zh_cn: 示例 50.6. 使用 classifier 的依赖

source: Example 50.7. Iterating over a configuration
zh_cn: 示例 50.7. 遍历一个配置

source: Example 50.8. Client module dependencies - transitive dependencies
zh_cn: 示例 50.8. 客户端模块依赖 - 传递依赖

source: Example 50.9. Project dependencies
zh_cn: 50.9. 项目依赖

source: Example 51.1. Defining an artifact using an archive task
zh_cn: 示例 51.1. 使用archive 任务定义一个构件

source: Example 51.2. Defining an artifact using a file
zh_cn: 示例 51.2. 使用文件定义构件

source: Example 51.3. Customizing an artifact
zh_cn: 示例 51.3. 自定义构件

source: Example 51.4. Map syntax for defining an artifact using a file
zh_cn: 示例 51.4. 基于map的语法定义一个文件构件。

source: Example 51.5. Configuration of the upload task
zh_cn: 示例 51.5. 上传任务的配置

source: Example 52.1. Using the Maven plugin
zh_cn: 示例 52.1. 使用 Maven 插件

source: Example 52.10. Accessing a mapping configuration
zh_cn: 示例 52.10. 访问映射配置

source: Example 52.2. Creating a stand alone pom.
zh_cn: 示例 52.2. 创建一个单独的 pom。

source: Example 52.3. Upload of file to remote Maven repository
zh_cn: 示例 52.3. 上传文件到远程 Maven 仓库

source: Example 52.4. Upload of file via SSH
zh_cn: 示例 52.4. 通过 SSH 上传文件

source: Example 52.5. Customization of pom
zh_cn: 示例 52.5. pom定制

source: Example 52.6. Builder style customization of pom
zh_cn: 示例 52.6. pom 的生成器类型自定义

source: Example 52.7. Modifying auto-generated content
zh_cn: 示例 52.7. 修改自动生成的内容

source: Example 52.8. Customization of Maven installer
zh_cn: 示例 52.8. Maven installer 的自定义

source: Example 52.9. Generation of multiple poms
zh_cn: 示例 52.9. 多个 poms 的生成

source: Example 53.1. Using the Signing plugin
zh_cn: 示例 53.1. 使用Signing插件

source: Example 53.2. Signing a configuration
zh_cn: 53.3.2. 签名一个配置

source: Example 53.3. Signing a configuration output
zh_cn: 示例 53.3. 签署一个配置的输出

source: Example 53.4. Signing a task
zh_cn: 53.4. 签名一个任务

source: Example 53.5. Signing a task output
zh_cn: 示例 53.5. 签名一个任务的输出

source: Example 53.6. Conditional signing
zh_cn: 53.6. 有条件的签名

source: Example 53.7. Signing a POM for deployment
zh_cn: 示例 53.7. 为部署签名 POM

source: Example 54.1. Defining a library component
zh_cn: 示例 54.1. 定义一个库组件

source: Example 54.10. Settings that apply to all binaries
zh_cn: 示例 54.10. 应用于所有二进制文件的设置

source: Example 54.11. Settings that apply to all shared libraries
zh_cn: 示例 54.11. 应用于所有共享库的设置

source: Example 54.12. Settings that apply to all binaries produced for the 'main' executable component
zh_cn: 示例 54.12. 应用于“main”可执行组件所产生的所有二进制文件的设置

source: Example 54.13. Settings that apply only to shared libraries produced for the 'main' library component
zh_cn: 示例 54.13. 仅应用于“main”library组件所产生的共享库的设置

source: Example 54.14. The 'windows-resources' plugin
zh_cn: 示例 54.14. 'windows-resources' 插件

source: Example 54.15. Configuring the location of Windows resource sources
zh_cn: 示例 54.15. 配置 Windows 资源源文件的位置

source: Example 54.16. Building a resource-only dll
zh_cn: 示例 54.16. 构建一个纯资源 dll

source: Example 54.17. Providing a library dependency to the source set
zh_cn: 示例 54.17. 向source set提供库依赖
